backend/app/controllers/lists_controller.rb

    def show
        @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @list = List.new(list_params)
        if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2020-10-22 19:51:03.807017"], ["updated_at", "2020-10-22 19:51:03.807017"]]